Documents/гф_ПеререзервированиеПодЗаказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>гф_ПеререзервированиеПодЗаказ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасходныйОрдерОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйОрдерНаТовары</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ГТД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НазначениеИсходное</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НазначениеФинальное</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/гф_ПеререзервированиеПодЗаказ/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

&После("ОбработкаПроведения")
Процедура гф_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ТоварыОрганизаций.Записывать = Истина;
	Движения.ТоварыОрганизаций.Записать();
	
	Если Товары.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ТоварыОрганизаций.Записывать = Истина;

    ВидЗапасов = ВидЗапасов(Товары[0].Номенклатура.ГруппаФинансовогоУчета); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаДляПроведения();
		
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Склад.гф_Организация);
	Запрос.УстановитьПараметр("Серия", Справочники.СерииНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ПерваяЧасть = Результат[3];  
	
	Таблица = ПерваяЧасть.Выгрузить();
	
	Остатки = Результат[4]; 
	
	ТаблицаОстатков = Остатки.Выгрузить();
	
	ВтораяЧасть = Результат[5];   
	
	Таблица2 = Таблица.СкопироватьКолонки();
	
	ВыборкаИтог = ВтораяЧасть.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КолОстаток = 0;
	ГТД = Справочники.НомераГТД.ПустаяСсылка();
	
	Пока ВыборкаИтог.Следующий() Цикл
		
		ВыборкаНазначение = ВыборкаИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаНазначение.Следующий() Цикл
			
			КолИтог = ВыборкаНазначение.Количество;
			ВыборкаДетали = ВыборкаНазначение.Выбрать();
			Индекс = 0;
			
			Пока ВыборкаДетали.Следующий() Цикл
				
				Если ВыборкаИтог.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
					
					СтруОтбора = Новый Структура;
					СтруОтбора.Вставить("Номенклатура", ВыборкаДетали.Номенклатура); 
					СтруОтбора.Вставить("Характеристика", ВыборкаДетали.Характеристика);
					СтруОтбора.Вставить("Назначение", ВыборкаДетали.Назначение);
					
					МассивОстатка = ТаблицаОстатков.НайтиСтроки(СтруОтбора);
					
					Для каждого Стр Из МассивОстатка Цикл
						
						Если КолИтог = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						НоваяСтрока = Таблица2.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетали);
						НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
						НоваяСтрока.НомерГТД = Стр.НомерГТД;
						Если ВыборкаДетали.Количество <= Стр.КоличествоОстаток Тогда
							КоличествоВСтроке = ВыборкаДетали.Количество;
							КоличествоЗанять = 0;
						Иначе
							КоличествоВСтроке =	Стр.КоличествоОстаток;
							КоличествоЗанять = ВыборкаДетали.Количество - Стр.КоличествоОстаток;
						КонецЕсли;
						
						НоваяСтрока.Количество = КоличествоВСтроке;
						КолИтог = КолИтог - КоличествоВСтроке;
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;	
		
	КонецЦикла;
	
	Таблица3 = Таблица2.Скопировать();
	Таблица3.Колонки.Добавить("Занято", Новый ОписаниеТипов("Булево"));
	Для каждого Стр3 Из Таблица3 Цикл
		Стр3.Занято = Ложь;
	КонецЦикла;
	
	Для каждого Стр1 Из Таблица Цикл 
		Если Стр1.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", Стр1.Номенклатура); 
		Отбор.Вставить("Характеристика", Стр1.Характеристика);
		Отбор.Вставить("Количество", Стр1.Количество);
		Отбор.Вставить("Занято", Ложь); 
		
		МассивРасход = Таблица3.НайтиСтроки(Отбор);
		Если МассивРасход.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не возможно провести документ Перерезервирования. Ошибки в остатках." ,,,,Отказ);
			Прервать;
		КонецЕсли;
		НоваяСтрока = Таблица2.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр1);
		НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
		НоваяСтрока.НомерГТД = МассивРасход[0].НомерГТД;
        МассивРасход[0].Занято = Истина;
		
	КонецЦикла;
	
	Для каждого Стр Из Таблица2 Цикл
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	КонецЦикла;
	
	Движения.ТоварыОрганизаций.Загрузить(Таблица);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекстЗапросаДляПроведения()
	
	Текст = "ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	Товары.Ссылка КАК Регистратор,
		|	&Организация КАК Организация,
		|	Товары.Ссылка.Дата КАК Период,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Номенклатура.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.ГТД КАК НомерГТД,
		|	Товары.Количество КАК Количество,
		|	Товары.НазначениеИсходное КАК Назначение
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	Документ.гф_ПеререзервированиеПодЗаказ.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	Товары.Ссылка,
		|	&Организация,
		|	Товары.Ссылка.Дата,
		|	Товары.Номенклатура,
		|	Товары.Номенклатура.ГруппаФинансовогоУчета,
		|	Товары.Характеристика,
		|	Товары.ГТД,
		|	Товары.Количество,
		|	Товары.НазначениеФинальное
		|ИЗ
		|	Документ.гф_ПеререзервированиеПодЗаказ.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КлючиАналитикиУчетаНоменклатуры.Ссылка КАК Ключ,
		|	КлючиАналитикиУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	КлючиАналитикиУчетаНоменклатуры.Характеристика КАК Характеристика,
		|	КлючиАналитикиУчетаНоменклатуры.Назначение КАК Назначение
		|ПОМЕСТИТЬ Ключи
		|ИЗ
		|	Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
		|ГДЕ
		|	(КлючиАналитикиУчетаНоменклатуры.Номенклатура, КлючиАналитикиУчетаНоменклатуры.Характеристика, КлючиАналитикиУчетаНоменклатуры.Серия, КлючиАналитикиУчетаНоменклатуры.МестоХранения, КлючиАналитикиУчетаНоменклатуры.Назначение) В
		|			(ВЫБРАТЬ
		|				Т.Номенклатура,
		|				Т.Характеристика,
		|				&Серия,
		|				&Склад,
		|				Т.Назначение
		|			ИЗ
		|				Товары КАК Т)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыЗапасов.Ссылка КАК ВидЗапасов,
		|	ВидыЗапасов.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета
		|ПОМЕСТИТЬ ВидыЗапасов
		|ИЗ
		|	Справочник.ВидыЗапасов КАК ВидыЗапасов
		|ГДЕ
		|	НЕ ВидыЗапасов.ПометкаУдаления
		|	И ВидыЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
		|	И ВидыЗапасов.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.ВидДвижения КАК ВидДвижения,
		|	Товары.Регистратор КАК Регистратор,
		|	Товары.Организация КАК Организация,
		|	Товары.Период КАК Период,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.НомерГТД КАК НомерГТД,
		|	Товары.Количество КАК Количество,
		|	Товары.Назначение КАК Назначение,
		|	ВидыЗапасов.ВидЗапасов КАК ВидЗапасов,
		|	Ключи.Ключ КАК АналитикаУчетаНоменклатуры
		|ПОМЕСТИТЬ ТоварыИтог
		|ИЗ
		|	Товары КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыЗапасов КАК ВидыЗапасов
		|		ПО Товары.ГруппаФинансовогоУчета = ВидыЗапасов.ГруппаФинансовогоУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ Ключи КАК Ключи
		|		ПО Товары.Номенклатура = Ключи.Номенклатура
		|			И Товары.Характеристика = Ключи.Характеристика
		|			И Товары.Назначение = Ключи.Назначение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыОрганизацийОстатки.Организация КАК Организация,
		|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ТоварыОрганизацийОстатки.ВидЗапасов КАК ВидЗапасов,
		|	ТоварыОрганизацийОстатки.НомерГТД КАК НомерГТД,
		|	ТоварыОрганизацийОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
		|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Назначение КАК Назначение
		|ИЗ
		|	РегистрНакопления.ТоварыОрганизаций.Остатки(
		|			&Дата,
		|			Организация = &Организация
		|				И (АналитикаУчетаНоменклатуры.Номенклатура, АналитикаУчетаНоменклатуры.Характеристика, АналитикаУчетаНоменклатуры.Назначение, АналитикаУчетаНоменклатуры.МестоХранения) В
		|					(ВЫБРАТЬ
		|						Т.Номенклатура,
		|						Т.Характеристика,
		|						Т.Назначение,
		|						&Склад
		|					ИЗ
		|						Товары КАК Т
		|					ГДЕ
		|						Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))) КАК ТоварыОрганизацийОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Назначение.Заказ.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыИтог.ВидДвижения КАК ВидДвижения,
		|	ТоварыИтог.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ТоварыИтог.ВидЗапасов КАК ВидЗапасов,
		|	ТоварыИтог.Регистратор КАК Регистратор,
		|	ТоварыИтог.Организация КАК Организация,
		|	ТоварыИтог.Период КАК Период,
		|	ТоварыИтог.Номенклатура КАК Номенклатура,
		|	ТоварыИтог.Характеристика КАК Характеристика,
		|	ТоварыИтог.НомерГТД КАК НомерГТД,
		|	ТоварыИтог.Количество КАК Количество,
		|	ТоварыИтог.Назначение КАК Назначение
		|ИЗ
		|	ТоварыИтог КАК ТоварыИтог
		|
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	ВидДвижения,
		|	Назначение";
		
     Возврат Текст;
	 
 КонецФункции

Функция ПолучитьАналитикаУчетаНоменклатуры(Номенклатура, Характеристика, Назначение, Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлючиАналитикиУчетаНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
		|ГДЕ
		|	КлючиАналитикиУчетаНоменклатуры.Номенклатура = &Номенклатура
		|	И КлючиАналитикиУчетаНоменклатуры.Характеристика = &Характеристика
		|	И КлючиАналитикиУчетаНоменклатуры.Серия = &Серия
		|	И КлючиАналитикиУчетаНоменклатуры.МестоХранения = &Склад
		|	И КлючиАналитикиУчетаНоменклатуры.Назначение = &Назначение";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Серия", Справочники.СерииНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Назначение", Назначение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ВидЗапасов(ГруппаФинансовогоУчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыЗапасов КАК Т
	|ГДЕ
	|	НЕ Т.ПометкаУдаления
	|	И Т.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|	И Т.Организация = &Организация
	|	И Т.ГруппаФинансовогоУчета = &ГруппаФинансовогоУчета";

	Запрос.УстановитьПараметр("Организация", Склад.гф_Организация);
	Запрос.УстановитьПараметр("ГруппаФинансовогоУчета", ГруппаФинансовогоУчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;	
	КонецЕсли;

КонецФункции 

#КонецОбласти
